
## :white_check_mark: Apply Succeeded (v3-proxy-api-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/65902)



<pre><code>Apply complete! Resources: 2 added, 1 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
aws_cloudwatch_log_group.aws-otel-collector-log-group: Refreshing state... [id=/Backend/V3ProxyApi-Dev/ecs/aws-otel-collector]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_region.region: Reading...
data.aws_caller_identity.caller: Reading...
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/V3ProxyApi-Dev/ecs/app]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/V3ProxyApi-Dev]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=v3proxyapi-dev-app]
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=410318598490]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=1756567564]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=eb0386bb-4c7d-4dd3-8fcd-81e303f0128b:V3ProxyApi-Dev-ECS]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 0s [id=/Shared/Vpc]
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/ef85e1b9-518a-45d8-a28e-25620a9c8f54]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_kms_alias.kms_alias: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z09559913DTUO4TFHSI32]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=V3ProxyApi-Dev-TaskExecutionRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=V3ProxyApi-Dev-TaskRole]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=V3ProxyApi-Dev-ECSCodeDeployRole]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::410318598490:policy/V3ProxyApi-Dev-TaskRolePolicy]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=ZCSIDA846KWLN]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=v3proxyapi-dev-app]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/7cfd6eb427bfebaa9986086a1de20180cc478f3f]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=3899912473]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::410318598490:policy/V3ProxyApi-Dev-TaskExecutionRolePolicy]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=ZCSIDA846KWLN_v3-proxy-api.getpocket.dev_NS]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z09559913DTUO4TFHSI32__86e75a42c27bea7052d688288554754b.v3-proxy-api.getpocket.dev._CNAME]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=V3ProxyApi-Dev-ECSCodeDeployRole-20230210200929469400000009]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=V3ProxyApi-Dev-TaskExecutionRole-2023021020092953590000000a]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=V3ProxyApi-Dev-TaskRole-2023021020092968650000000b]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Refreshing state... [id=V3ProxyApi-Dev]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=V3ProxyApi-Dev-TaskExecutionRole-20230210200929264900000008]
local_file.application_ecs_service_appspec_94386B9C: Refreshing state... [id=c525867038a6ae29df03ab1d0ccecd852e79f9ed]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-012481e83ffa5e152]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-0d7d981202f180e3e]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/v3Prxy20230210200928621200000006/98a920103a6ddf1c]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/v3Prxy20230210200928547400000004/8106c9d0fb215d16]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-039446da37ec7b063]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 0s [id=us-east-1]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/v3Prxy2023021020093180370000000c/a6568abf5b5ec3a6]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 0s [id=us-east-1]
aws_alb_listener.application_listener_http_D74EC0ED: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/v3Prxy2023021020093180370000000c/a6568abf5b5ec3a6/1d2a8ca38c516289]
aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0: Refreshing state... [id=V3ProxyApi-Dev-Alarm-HTTPTarget5xxErrorRate]
aws_route53_record.application_alb_record_8EA9D3F9: Refreshing state... [id=Z09559913DTUO4TFHSI32_v3-proxy-api.getpocket.dev_A_1]
aws_alb_listener.application_listener_https_D31CB055: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/v3Prxy2023021020093180370000000c/a6568abf5b5ec3a6/ae0fda3d11b6df98]
aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/v3Prxy2023021020093180370000000c/a6568abf5b5ec3a6/ae0fda3d11b6df98/641b1527aeae502c]
aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/V3ProxyApi-Dev/V3ProxyApi-Dev]
aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED: Refreshing state... [id=V3ProxyApi-Dev]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Refreshing state... [id=service/V3ProxyApi-Dev/V3ProxyApi-Dev]
aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247: Refreshing state... [id=b6ce0bba-0512-445b-aa6d-3fa9909a9144]
aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2: Refreshing state... [id=V3ProxyApi-Dev-ScaleOutPolicy]
aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511: Refreshing state... [id=V3ProxyApi-Dev-ScaleInPolicy]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1: Refreshing state... [id=V3ProxyApi-Dev Service Low CPU]
aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0: Refreshing state... [id=V3ProxyApi-Dev Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:410318598490:task-definition/V3ProxyApi-Dev:21" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:410318598490:task-definition/V3ProxyApi-Dev" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ healthCheck            = {
                      ~ command     = [
                            "CMD-SHELL",
                          - "curl -f http://localhost:4029/.well-known/server-health || exit 1",
                          + "curl -f http://localhost:4030/.well-known/server-health || exit 1",
                        ]
                        # (4 unchanged attributes hidden)
                    }
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          ~ containerPort = 4029 -> 4030
                          ~ hostPort      = 4029 -> 4030
                          - protocol      = "tcp"
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "V3ProxyApi-Dev" -> (known after apply)
      ~ revision                 = 21 -> (known after apply)
        tags                     = {
            "environment" = "Dev"
            "service"     = "V3ProxyApi"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_security_group.application_ecs_service_ecs_security_group_231C6B1E will be updated in-place
  ~ resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
        id                     = "sg-039446da37ec7b063"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "required"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0d7d981202f180e3e",
                ]
              - self             = false
              - to_port          = 4029
            },
          + {
              + cidr_blocks      = []
              + description      = "required"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0d7d981202f180e3e",
                ]
              + self             = false
              + to_port          = 4030
            },
        ]
        name                   = "V3ProxyApi-Dev-ECSSecurityGroup2023021020093180560000000d"
        tags                   = {
            "environment" = "Dev"
            "service"     = "V3ProxyApi"
        }
        # (8 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=V3ProxyApi-Dev]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Modifying... [id=sg-039446da37ec7b063]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=V3ProxyApi-Dev]
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=4de3fce37079f58a8b9dc6b17f2c51b7e99642cc]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Modifications complete after 1s [id=sg-039446da37ec7b063]

Apply complete! Resources: 2 added, 1 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"e271703a-96f5-4cd8-a5b9-b223ed05b9ef","JobName":"v3-proxy-api_infrastructure_apply_dev","PRNumber":231,"Program":"tfcmt","SHA1":"4f7c180ecd06867704f36e705d673ffcd3422f42","Target":"v3-proxy-api-cdk-dev","Vars":{}} -->